18-sessions-and-cookies/rails-quest/app/views/responses/new.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? ORDER BY RANDOM()  [["question_id", 59]]
---
    <label>Choices:</label>
    <% @question.random_answers.each do | answer | %>