18-sessions-and-cookies/rails-quest/app/controllers/responses_controller.rb

    def new
        @number_correct = session[:number_correct]
        @message = flash[:message]
        @question = Question.order("RANDOM()").limit(1)[0]
---
SELECT  "questions".* FROM "questions" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]

    def create
        if(session[:number_correct])
            @number_correct = session[:number_correct]
        else
            @number_correct = 0
        end
        response = Response.create(response_params)
---
INSERT INTO "responses" ("question_id", "answer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["question_id", 51], ["answer_id", 201], ["created_at", "2019-06-11 15:30:35.607146"], ["updated_at", "2019-06-11 15:30:35.607146"]]